In [1]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Asha", "Rahul", "Sita", None, "Kiran"],
    "Age": [23, np.nan, 29, 25, None],
    "Salary": [45000, 52000, None, 48000, 51000],
    "City": ["Bangalore", "Mysuru", "Bangalore", "Mysuru", None]
}

df = pd.DataFrame(data)
print(df)

    Name   Age   Salary       City
0   Asha  23.0  45000.0  Bangalore
1  Rahul   NaN  52000.0     Mysuru
2   Sita  29.0      NaN  Bangalore
3   None  25.0  48000.0     Mysuru
4  Kiran   NaN  51000.0       None

In [ ]:
#missing values
df.isnull()

    Name    Age  Salary   City
0  False  False   False  False
1  False   True   False  False
2  False  False    True  False
3   True  False   False  False
4  False   True   False   True

In [3]:
#count missing values
df.isnull().sum()

Name      1
Age       2
Salary    1
City      1
dtype: int64

In [4]:
#
df.isnull().any()

Name      True
Age       True
Salary    True
City      True
dtype: bool

In [6]:

df.dropna()

   Name   Age   Salary       City
0  Asha  23.0  45000.0  Bangalore

In [7]:

df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [8]:
df.fillna(0)

    Name   Age   Salary       City
0   Asha  23.0  45000.0  Bangalore
1  Rahul   0.0  52000.0     Mysuru
2   Sita  29.0      0.0  Bangalore
3      0  25.0  48000.0     Mysuru
4  Kiran   0.0  51000.0          0

In [11]:
df["Age"].fillna(df["Age"].mean(),  inplace=true)

NameError: name 'true' is not defined

In [13]:
df["Salary"].fillna(df["Salary"].median(),  inplace=true)

NameError: name 'true' is not defined

In [15]:
df.fillna(method="ffill")
df.fillna(method="bfill")

C:\Users\User\AppData\Local\Temp\ipykernel_25532\3857985487.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")
C:\Users\User\AppData\Local\Temp\ipykernel_25532\3857985487.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="bfill")

    Name   Age   Salary       City
0   Asha  23.0  45000.0  Bangalore
1  Rahul  29.0  52000.0     Mysuru
2   Sita  29.0  48000.0  Bangalore
3  Kiran  25.0  48000.0     Mysuru
4  Kiran   NaN  51000.0       None

In [16]:
df.replace("unknown", np.nan, inplace=True)
df.replace(-1, np.nan, inplace=True)